{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of key frontend files.",
  "frontend/CUSTOM_DOMAIN.md": "Documentation describing how to configure a custom domain for an Internet Computer deployment.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theme tokens.",
  "frontend/index.html": "Base HTML file loading the React app root and main entry script.",
  "frontend/public/404.html": "Fallback redirect page sending all unknown routes back to the root.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and rendering them.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive navigation header with logo, desktop links, and a mobile menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing academy branding, description, and clickable site URL.",
  "frontend/src/components/layout/SiteLayout.tsx": "Shared layout composing header, outlet, and footer.",
  "frontend/src/content/siteContent.ts": "Centralized content config storing hero text, leadership, courses, benefits, and site URL.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor linked to the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Stub hook returning no backend queries for this static site.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, approach, and reasons to choose the academy.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact information and a form that opens an email draft on submit.",
  "frontend/src/pages/CourseDetailsPage.tsx": "Displays detailed information for each course including overview, audience, and learning outcomes.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, leadership info, and course previews.",
  "frontend/src/pages/TutorsPage.tsx": "Renders the Tutors page, mapping tutor data from siteContent into styled profile cards with placeholder notices.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Describes the project’s current state, goals, features, and architectural notes for rebuilding and deploying the academy website."
}