{
  "kind": "build_request",
  "title": "Add Home page leadership + Arabic Bismillah, and reflect requested custom domain branding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add the Arabic Bismillah text “بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ” to the Home page in a prominent, visually respectful placement (e.g., above the main hero title), ensuring it renders correctly on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-16",
          "msg-17"
        ],
        "quotes": [
          "And add Bismillah hirrahman nir raheem in Arabic on home page"
        ]
      },
      "acceptanceCriteria": [
        "Home page displays the exact Arabic text: “بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ”.",
        "The Arabic text is visible in the Home page hero area and remains readable across common viewport sizes (mobile, tablet, desktop).",
        "No other pages are broken and existing Home sections (hero, courses, benefits, CTA) still render."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a “Leadership” section on the Home page listing these roles and names: Founder/CEO: SYED IRFAN ALI; Vice President: Md Rayyan Malik; President: Md Zaid Uddin. Store this leadership data in the centralized content config so it can be edited without changing page components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13",
          "msg-15"
        ],
        "quotes": [
          "Place same thing add founder / Ceo named as SYED IRFAN ALI  vise president named as Md Rayyan Malik  President named as Md Zaid Uddin",
          "Add on home page"
        ]
      },
      "acceptanceCriteria": [
        "Home page includes a clearly labeled Leadership section containing exactly the three requested roles and names.",
        "Leadership entries are sourced from the centralized content file (frontend/src/content/siteContent.ts) rather than hard-coded directly in the page component.",
        "Section layout is responsive and consistent with the existing site theme (spacing, typography, card/border styles)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Reflect the requested public website name/URL \"https://www.iqratultajweedonlinequranacademy.com\" in site branding by adding it to centralized site content and rendering it in at least one obvious location in the UI (e.g., footer and/or Contact page) as a clickable link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-18"
        ],
        "quotes": [
          "Ok get started i want to see my website with updates and named as https://www.iqratultajweedonlinequranacademy.com"
        ]
      },
      "acceptanceCriteria": [
        "The URL “https://www.iqratultajweedonlinequranacademy.com” is stored in a centralized content/config location (e.g., frontend/src/content/siteContent.ts).",
        "The URL is rendered somewhere user-visible (footer and/or contact page) as a clickable link that points to the same URL.",
        "All existing routes continue to work, and layout remains consistent across pages."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add documentation describing how to point a custom domain (https://www.iqratultajweedonlinequranacademy.com) to the Internet Computer deployment, including the fact that domain/DNS configuration is done outside the app and the deployed canister URL will still work independently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-18"
        ],
        "quotes": [
          "named as https://www.iqratultajweedonlinequranacademy.com"
        ]
      },
      "acceptanceCriteria": [
        "A new documentation file exists in the repository (e.g., CUSTOM_DOMAIN.md or DEPLOYMENT.md) explaining the high-level steps to use a custom domain with an Internet Computer hosted site.",
        "The documentation clearly states that the app cannot automatically claim/configure the custom domain and that DNS/domain ownership changes happen outside the codebase.",
        "The documentation includes the exact requested domain string: https://www.iqratultajweedonlinequranacademy.com."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (compose only).",
    "Backend must remain single-actor Motoko architecture; do not add additional backend services.",
    "No third-party email service integrations; keep the existing mailto: contact form approach."
  ],
  "nonGoals": [
    "Purchasing a domain name or performing registrar/DNS changes on behalf of the user.",
    "Guaranteeing that https://www.iqratultajweedonlinequranacademy.com will be live without external DNS configuration (this is outside the app’s control).",
    "Adding new pages/routes beyond the existing Home, About, Courses, Tutors, and Contact pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}