{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home page Bismillah + Leadership section + custom domain branding/link + custom domain documentation",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Add the Arabic Bismillah text to the Home page hero area with respectful, responsive placement.",
      "acceptanceCriteria": [
        "Home page displays the exact Arabic text: “بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ”.",
        "The Arabic text is visible in the Home page hero area and remains readable across common viewport sizes (mobile, tablet, desktop).",
        "No other pages are broken and existing Home sections (hero, courses, benefits, CTA) still render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a prominent Arabic Bismillah line (exact text) in the hero section above the main hero title, using responsive typography/spacing and appropriate RTL-aware rendering so it remains readable on mobile/tablet/desktop."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a responsive Leadership section to the Home page, sourcing entries from centralized site content.",
      "acceptanceCriteria": [
        "Home page includes a clearly labeled Leadership section containing exactly the three requested roles and names.",
        "Leadership entries are sourced from the centralized content file (frontend/src/content/siteContent.ts) rather than hard-coded directly in the page component.",
        "Section layout is responsive and consistent with the existing site theme (spacing, typography, card/border styles)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Add a centralized leadership content block (three entries) for Founder/CEO: SYED IRFAN ALI; Vice President: Md Rayyan Malik; President: Md Zaid Uddin so it can be edited without changing page components."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Render a clearly labeled Leadership section on the Home page using the new leadership content from frontend/src/content/siteContent.ts, styled responsively to match existing card/border/typography patterns."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Centralize the requested public website URL in site content and render it in the UI as a clickable link.",
      "acceptanceCriteria": [
        "The URL “https://www.iqratultajweedonlinequranacademy.com” is stored in a centralized content/config location (e.g., frontend/src/content/siteContent.ts).",
        "The URL is rendered somewhere user-visible (footer and/or contact page) as a clickable link that points to the same URL.",
        "All existing routes continue to work, and layout remains consistent across pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Add the public website URL https://www.iqratultajweedonlinequranacademy.com to centralized site content (e.g., a branding/siteUrl field)."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Render the centralized public website URL as an obvious, clickable link in the footer (pointing to the same URL) while keeping existing footer layout/branding intact."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add repository documentation describing how to point the custom domain to the Internet Computer deployment.",
      "acceptanceCriteria": [
        "A new documentation file exists in the repository (e.g., CUSTOM_DOMAIN.md or DEPLOYMENT.md) explaining the high-level steps to use a custom domain with an Internet Computer hosted site.",
        "The documentation clearly states that the app cannot automatically claim/configure the custom domain and that DNS/domain ownership changes happen outside the codebase.",
        "The documentation includes the exact requested domain string: https://www.iqratultajweedonlinequranacademy.com."
      ],
      "file_operations": [
        {
          "path": "frontend/CUSTOM_DOMAIN.md",
          "operation": "create",
          "description": "Create documentation explaining high-level custom domain setup for an Internet Computer hosted site, explicitly stating DNS/domain ownership configuration happens outside the app, and that the deployed canister URL will continue to work independently; include the exact domain string https://www.iqratultajweedonlinequranacademy.com."
        }
      ]
    }
  ]
}